## **[MySQL Self Join](https://www.mysqltutorial.org/mysql-self-join/)**

Joins a table to itself using the inner join or left join.

In [1]:
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
from IPython.display import Image, SVG

from sqlalchemy_utils import database_exists, create_database
from sqlalchemy import create_engine, inspect, MetaData, text
from sqlalchemy_schemadisplay import create_schema_graph
import pymysql

pd.set_option(
    'display.max_columns', None,
    'expand_frame_repr', True,
    'display.max_colwidth', None,
    'display.max_rows', 10,
)

pd.set_option('display.width', 65)

In [2]:
# connect to the classicmodels database
connect_args={'ssl':{'fake_flag_to_enable_tls': True}}

engine = create_engine('mysql+pymysql://namlq:abc123@localhost/classicmodels',
                       connect_args=connect_args, echo=False
                         )
inspector = inspect(engine)

### MySQL self join examples

#### Inspecting left table and right table in pandas

In [3]:
employees = (
    pd.read_sql_table('employees', engine)
    [['employeeNumber', 'lastName', 'firstName',
      'jobTitle', 'reportsTo']]
)

employees.head()

,employeeNumber,lastName,firstName,jobTitle,reportsTo
0,1002,Murphy,Diane,President,NaN
1,1056,Patterson,Mary,VP Sales,1002.0
2,1076,Firrelli,Jeff,VP Marketing,1002.0
3,1088,Patterson,William,Sales Manager (APAC),1056.0
4,1102,Bondur,Gerard,Sale Manager (EMEA),1056.0

In [4]:
# the left table
left_table = (
    employees
    .assign(directStaff = employees.lastName + ' ' + employees.firstName)
    .rename(columns={
        'jobTitle': 'staffTitle', 'reportsTo': 'left_reportsTo'})
    [['directStaff', 'staffTitle', 'left_reportsTo']]
)

left_table.head()

         directStaff            staffTitle  left_reportsTo
0       Murphy Diane             President             NaN
1     Patterson Mary              VP Sales          1002.0
2      Firrelli Jeff          VP Marketing          1002.0
3  Patterson William  Sales Manager (APAC)          1056.0
4      Bondur Gerard   Sale Manager (EMEA)          1056.0

In [5]:
# the right table
right_table = (
    employees
    .assign(manager = employees.lastName + ' ' + employees.firstName)
    .rename(columns={
        'jobTitle': 'managerTitle', 'employeeNumber': 'right_employeeNumber'})
    [['right_employeeNumber', 'manager', 'managerTitle']]
)
right_table.head()

,right_employeeNumber,manager,managerTitle
0,1002,Murphy Diane,President
1,1056,Patterson Mary,VP Sales
2,1076,Firrelli Jeff,VP Marketing
3,1088,Patterson William,Sales Manager (APAC)
4,1102,Bondur Gerard,Sale Manager (EMEA)

#### 1) MySQL self join using INNER JOIN clause

- Self Join to get the whole organization structure: step by step in pandas codes:

In [6]:
# merge the two tables
(pd.merge(
    left=left_table, right=right_table, left_on='left_reportsTo',
    right_on='right_employeeNumber', how='inner')
 .assign(left_reportsTo = lambda df: df.left_reportsTo.astype('Int64'))
 .head()
)

,directStaff,staffTitle,left_reportsTo,right_employeeNumber,manager,managerTitle
0,Patterson Mary,VP Sales,1002,1002,Murphy Diane,President
1,Firrelli Jeff,VP Marketing,1002,1002,Murphy Diane,President
2,Patterson William,Sales Manager (APAC),1056,1056,Patterson Mary,VP Sales
3,Bondur Gerard,Sale Manager (EMEA),1056,1056,Patterson Mary,VP Sales
4,Bow Anthony,Sales Manager (NA),1056,1056,Patterson Mary,VP Sales

MySQL codes:

In [7]:
# .5 ms ± 310 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)
# %%timeit
string = '''
SELECT 
    CONCAT(r.lastName, ', ', r.firstName) AS manager,
    r.jobTitle AS managerTitle,
    CONCAT(l.lastName, ', ', l.firstName) AS 'directStaff',
    l.jobTitle As staffTitle
FROM employees l
INNER JOIN employees r ON r.employeeNumber = l.reportsTo
ORDER BY manager, directStaff
;'''

df1 = pd.read_sql(string, engine)

Equivalent pandas codes:

In [8]:
# 37.4 ms ± 1.63 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)
# %%timeit
employees = pd.read_sql_table('employees', engine)
df2 = (
    pd.merge(left=employees, right=employees,
             left_on='reportsTo', right_on='employeeNumber', 
             how='inner', suffixes=['_left', '_right'])
    .assign(directStaff = lambda df: df['lastName_left'] + ', ' + df['firstName_left'],
            manager = lambda df: df['lastName_right'] + ', ' + df['firstName_right'])
    .rename(columns={'jobTitle_left': 'staffTitle',
                     'jobTitle_right': 'managerTitle'})
    [['manager', 'managerTitle', 'directStaff', 'staffTitle']]
    .sort_values(by=['manager', 'directStaff'],
                 key=lambda col: col.str.upper(),
                 ignore_index=True)
)

In [9]:
df1.equals(df2)

True

In [10]:
df1.head()

,manager,managerTitle,directStaff,staffTitle
0,"Bondur, Gerard",Sale Manager (EMEA),"Bondur, Loui",Sales Rep
1,"Bondur, Gerard",Sale Manager (EMEA),"Bott, Larry",Sales Rep
2,"Bondur, Gerard",Sale Manager (EMEA),"Castillo, Pamela",Sales Rep
3,"Bondur, Gerard",Sale Manager (EMEA),"Gerard, Martin",Sales Rep
4,"Bondur, Gerard",Sale Manager (EMEA),"Hernandez, Gerard",Sales Rep

#### 2) MySQL self join using LEFT JOIN clause

Use the `LEFT JOIN` clause instead of `INNER JOIN` to include the President:

In [11]:
# merge the two tables
(pd.merge(
    left=left_table, right=right_table, left_on='left_reportsTo',
    right_on='right_employeeNumber', how='left')
 .assign(left_reportsTo = lambda df: df.left_reportsTo.astype('Int64'))
 .head()
)

,directStaff,staffTitle,left_reportsTo,right_employeeNumber,manager,managerTitle
0,Murphy Diane,President,<NA>,NaN,NaN,NaN
1,Patterson Mary,VP Sales,1002,1002.0,Murphy Diane,President
2,Firrelli Jeff,VP Marketing,1002,1002.0,Murphy Diane,President
3,Patterson William,Sales Manager (APAC),1056,1056.0,Patterson Mary,VP Sales
4,Bondur Gerard,Sale Manager (EMEA),1056,1056.0,Patterson Mary,VP Sales

MySQL codes:

In [12]:
# 2.18 ms ± 161 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)
# %%timeit
string = '''
SELECT 
    IFNULL(CONCAT(r.lastName, ', ', r.firstName), 'Administrative Council') AS manager,
    IFNULL(r.jobTitle, 'Administrative Council') AS managerTitle,
    CONCAT(l.lastName, ', ', l.firstName) AS 'directStaff',
    l.jobTitle As staffTitle
FROM employees l
LEFT JOIN employees r ON r.employeeNumber = l.reportsTo
ORDER BY manager, directStaff
;'''

df1 = pd.read_sql(string, engine)

pandas codes:

In [13]:
# 39.7 ms ± 2.42 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)
# %%timeit
employees = pd.read_sql_table('employees', engine)

df2 = (
    pd.merge(
        left=employees, right=employees, left_on='reportsTo', 
        right_on='employeeNumber', how='left', suffixes=['_left', '_right'])
    .assign(manager = lambda df: df['lastName_right'] + ', ' + df['firstName_right'],
            directStaff = lambda df: df['lastName_left'] + ', ' + df['firstName_left'])
    .rename(columns={'jobTitle_left': 'staffTitle', 'jobTitle_right': 'managerTitle'})
    [['manager', 'managerTitle', 'directStaff', 'staffTitle']]
    .fillna('Administrative Council')
    .sort_values(by=['manager', 'directStaff'], ignore_index=True)
)

In [14]:
df1.equals(df2)

True

In [15]:
df1.head()

,manager,managerTitle,directStaff,staffTitle
0,Administrative Council,Administrative Council,"Murphy, Diane",President
1,"Bondur, Gerard",Sale Manager (EMEA),"Bondur, Loui",Sales Rep
2,"Bondur, Gerard",Sale Manager (EMEA),"Bott, Larry",Sales Rep
3,"Bondur, Gerard",Sale Manager (EMEA),"Castillo, Pamela",Sales Rep
4,"Bondur, Gerard",Sale Manager (EMEA),"Gerard, Martin",Sales Rep

#### 3) Using MySQL self join to compare successive rows

In [16]:
customers = pd.read_sql_table('customers', engine)

In [17]:
(customers
 [['customerName', 'city']]
 .sort_values('city', ignore_index=True)
 .head()
)

                 customerName        city
0            Warburg Exchange      Aachen
1       Diecast Classics Inc.   Allentown
2            Schuyler Imports   Amsterdam
3             GiftsForHim.com    Auckland
4  Down Under Souveniers, Inc  Auckland

In [18]:
string = '''
SELECT
    l.city,
    l.customerName AS customerName_left,
    r.customerName AS customerName_right
FROM customers l
INNER JOIN customers r
    ON l.city = r.city 
    AND l.customerName > r.customerName
ORDER BY
    city, customerName_left, customerName_right
;'''

df1 = pd.read_sql(string, engine)

In [19]:
customers = (
    pd.read_sql_table('customers', engine)
    .assign(city = lambda df: df.city.str.strip())
)

df2 = (
    pd.merge(left=customers, right=customers, on='city',
             how='inner', suffixes=['_left', '_right'])
    .query('customerName_left > customerName_right')
    [['city', 'customerName_left', 'customerName_right']]
    .sort_values(['city', 'customerName_left', 'customerName_right'],
                 ignore_index=True, key = lambda col: col.str.upper())
)

In [20]:
(df1
 .assign(city = df1.city.str.strip())
 .equals(df2)
)

True

In [21]:
df1.head()

,city,customerName_left,customerName_right
0,Auckland,GiftsForHim.com,"Down Under Souveniers, Inc"
1,Auckland,Kelly's Gift Shop,"Down Under Souveniers, Inc"
2,Auckland,Kelly's Gift Shop,GiftsForHim.com
3,Boston,Gifts4AllAges.com,Diecast Collectables
4,Brickhaven,Collectables For Less Inc.,Auto-Moto Classics Inc.